spec/data/ccms/case_add_status_request.xml

<?xml version='1.0' encoding='UTF-8'?>
<soap:Envelope xmlns:soap='http://schemas.xmlsoap.org/soap/envelope/'
               xmlns:secext='http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd'
               xmlns:casebim='http://legalservices.gov.uk/CCMS/CaseManagement/Case/1.0/CaseBIM'
               xmlns:hdr='http://legalservices.gov.uk/Enterprise/Common/1.0/Header'>
  <soap:Header>
    <secext:Security>
      <secext:UsernameToken>
        <secext:Username>my_soap_client_username</secext:Username>
        <secext:Password Type='password_type'>xxxxx</secext:Password>
      </secext:UsernameToken>
    </secext:Security>
  </soap:Header>
  <soap:Body>
    <casebim:CaseAddUpdtStatusRQ>
      <hdr:HeaderRQ>
        <hdr:TransactionRequestID>20190101121530123456</hdr:TransactionRequestID>
        <hdr:Language>ENG</hdr:Language>
        <hdr:UserLoginID>my_login</hdr:UserLoginID>
        <hdr:UserRole>my_role</hdr:UserRole>
      </hdr:HeaderRQ>
      <casebim:TransactionID>20190101121530123456</casebim:TransactionID>
    </casebim:CaseAddUpdtStatusRQ>
  </soap:Body>
</soap:Envelope>
